#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/testimg/learn-terraform-github-actions-azure/runs/run-P6rMA3j558b4zdXM

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/virtualNetworks/terraform-vnet]
azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/networkSecurityGroups/nsg]
azurerm_public_ip.publicip: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/publicIPAddresses/publicip1]
azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/virtualNetworks/terraform-vnet/subnets/subnetterra]
azurerm_network_interface.nic: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/networkInterfaces/nic]
azurerm_virtual_network.vnet: Drift detected (update)
azurerm_network_interface.nic: Drift detected (update)
azurerm_subnet.subnet: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "ARM_SUBSCRIPTION_ID" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-P6rMA3j558b4zdXM/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "ARM_CLIENT_SECRET" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-P6rMA3j558b4zdXM/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_username                  = "fuatu"
      + allow_extension_operations      = true
      + computer_name                   = "terraformvm"
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "eastus"
      + max_bid_price                   = -1
      + name                            = "terraform-experiment"
      + network_interface_ids           = [
          + "/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/networkInterfaces/nic",
        ]
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "fuat-terraform-experiment"
      + size                            = "Standard_B1ls"
      + virtual_machine_id              = (known after apply)

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDdOgHn70smnYAD1ceyyyItf3oQ+zyZCh2wy/OmnrBYbpEc2a44dT1qKPQAFyDNDxa777WWXlWCpLEhBHhRBvOAjRF434JbP1iUsJyOBDav1OuGVgFxfOcBwaHdcHd9r2WKssqI/b4tnrOgh3bFMkKSN5k9BxmRfiS90w2qW5cOWybWjNq7+rw3nihI9rIFHNnQ5BCd1+oFHmlyanhW5fHne6WFlPCQl9HmLiiN9luwQRGLIgJDYusuQ21ujkhU5z1XGEoVV5BD0+Hq1mK2XFbiAapebuyeaQH0/VCmophdL4I6EfLE3W5eXfT/kYEblJ9/RSQawVY1qA9eUMuF3Jk/ fuatulugay@Fuats-MacBook-Pro.local"
          + username   = "fuatu"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "osdisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "20.04-LTS"
          + version   = "latest"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @fuatu, Action: `pull_request`*